run/tutorials/case3_compaction/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    seaBed
    {
        type            propagatingPressureWave;
        #include "../constant/waveProperties"
    }
    
    frontBack
    {
        type            empty;
    }
    
    soilDomainBottom
    {
        type            buoyantRhoPressure;
        //type            zeroGradient;
    }
    
    "left|right"
    {
        type            splitCyclic;
    }

    sol
    {
        type            splitCyclic;
        //patchType       splitCyclic;
        //type            cyclicPressureFixedValue;
        //value           uniform 0;     
    }

    liq
    {
        type            splitCyclic;
        //patchType       splitCyclic;
        //type            buoyantRhoMPressure;
        //value           uniform 0;

        
    }

    
    
}


// ************************************************************************* //
