run/tutorials/case3_compaction/0/Vm
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Vm;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    seaBed
    {
        type            zeroGradient;
    }

    frontBack
    {
        type            empty;
    }

    soilDomainBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    "left|right"
    {
        type            splitCyclic;
    }

    liq
    {
        type            splitCyclic;
        //patchType       splitCyclic;
        //type            zeroGradient;
    }
    
    sol
    {
        type            splitCyclic;
        //patchType       splitCyclic;ls
        //type            zeroGradient;
    }
}


// ************************************************************************* //
