run/tutorials/case3_compaction/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 1000;
boundaryField
{
    seaBed
    {
        type            fixedValue;
        value           uniform 1000;
    }
    frontBack
    {
        type            empty;
    }
    soilDomainBottom
    {
        type            calculated;
        value           uniform 1000;
    }
    left
    {
        type            splitCyclic;
    }
    right
    {
        type            splitCyclic;
    }
    liq
    {
        patchType       splitCyclic;
        type            fixedValue;
        value           uniform 1000;
    }
    sol
    {
        patchType       splitCyclic;
        type            fixedValue;
        value           uniform 1000;
    }
}


// ************************************************************************* //
