run/tutorials/case3_compaction/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          probesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//type probes;
// Fields to be probed. runTime modifiable!
fields
(
    p
    pMean
    liqueCriteria
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (1 0 -0.050000)
    (1 0 -0.100000)
    (1 0 -0.150000)
    (1 0 -0.180000)


);


// ************************************************************************* //
